# -*- coding: utf-8 -*-

require 'sinatra'
require 'haml'

get '/' do
  #初期設定
  @questionData = Array[["性別を教えて下さい",["私は男です","私は女です"]],["最初に好きになった人の伸長は？",["めっちゃ高かった","めっちゃ低かった","ふつう"]]]
  haml :question
end

post '/' do

  #初期設定
  @questionData = Array[["性別を教えて下さい",["私は男です","私は女です"]],["最初に好きになった人の伸長は？",["めっちゃ高かった","めっちゃ低かった","ふつう"]]]

  #受け取ったデータぶち込む
  @answer = params[:answer]

  @pointData = Array[[["10","0"],["10","0","0"]],[["10","0"],["0","10","0"]],[["0","10"],["10","0","0"]],[["0","10"],["0","10","0"]]]

  haml :result

end
